//  1.Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
let i = 1;
while (i <= 10) {
  console.log(i);
  i += 1;
}

// 2.Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue.

for (let i = 2; i <= 20; i++) {
  if (i % 2 === 1) {
    continue;
  }
  console.log(i);
}

// 3.Вивести на екран таблицю множення числа 7 за допомогою циклу for.

for (let i = 7; i >= 7; i += 7) {
  if (i === 70) {
    break;
  }
  console.log(i);
}

// 4.Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.
const numbers = [1, 2, 3, 4, 5];
let j = 1;
while (j <= numbers.length) {
  console.log(j);
  j += 1;
}

// 5.Створити масив із числами від 1 до 10.
//  За допомогою циклу for пройтися по масиву та вивести на екран всі числа,
//   крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

const arrey = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 1; i <= arrey.length; i++) {
  if (i === 7) {
    break;
  }
  console.log(i);
}

// 6.Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число,
// що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const n = 15;
for (let i = 1; i < 20; i++) {
  if (i >= n) {
    break;
  }
  console.log(i);
}

// 7.За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3.
//  Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let k = 1;
while (k <= 20) {
  if (k % 3 === 0) {
    k += 1;
    continue;
  }
  console.log(k);
  k += 1;
}
